# Missing value

Let's show a few convenient methods to deal with Missing Data in pandas:

In [32]:
import numpy as np
import pandas as pd

In [33]:
pd.NA
np.nan
np.NAN
np.NaN

nan

In [34]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,pd.NA,''],
                  'C':[1,2,3]})

In [35]:
df

     A     B  C
0  1.0     5  1
1  2.0  <NA>  2
2  NaN        3

In [38]:
# df.to_csv('Testing_missingvalue.csv', index=False)

In [39]:
df.dtypes

A    float64
B     object
C      int64
dtype: object

In [40]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True  False  False

In [41]:
df

     A     B  C
0  1.0     5  1
1  2.0  <NA>  2
2  NaN        3

In [42]:
df[df['A'].isnull()]

    A B  C
2 NaN    3

In [43]:
df.isnull().sum()

A    1
B    1
C    0
dtype: int64

In [44]:
df

     A     B  C
0  1.0     5  1
1  2.0  <NA>  2
2  NaN        3

In [45]:
df.dropna()

     A  B  C
0  1.0  5  1

In [46]:
df1 = df.copy()

In [47]:
df

     A     B  C
0  1.0     5  1
1  2.0  <NA>  2
2  NaN        3

In [51]:
df2 = df.dropna()

In [52]:
df2

     A  B  C
0  1.0  5  1

In [48]:
df1.dropna(inplace=True)

In [50]:
df1

     A  B  C
0  1.0  5  1

In [54]:
df.dropna(subset = ['B'])

     A  B  C
0  1.0  5  1
2  NaN     3

In [49]:
df

     A     B  C
0  1.0     5  1
1  2.0  <NA>  2
2  NaN        3

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(thresh=2)

In [ ]:
df.dropna(thresh=0)

In [ ]:
df.dropna(thresh=1)

In [ ]:
df.fillna(value='FILL VALUE')

In [ ]:
df

In [ ]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [ ]:
df

In [ ]:
df['B'] = df['B'].fillna(value =df['C'].max())
df['B']

In [ ]:
df